import { atom } from "recoil";
// import profile from "../../Component/style/img/profile.png";

export const reviewDataAtom = atom({
  key: "reviewData",
  default: [
    // {
    //   title: "카페 아름다운 분위기",
    //   content:
    //     "이 카페의 분위기는 정말 아름답고 편안합니다. 인테리어도 세련되어 있고 조명도 매우 좋아요. 음료도 맛있고 다양한 종류를 즐길 수 있어서 좋았습니다. 가격 대비해서 정말 만족스러웠어요.",
    //   rating: "LIKE",
    // },
    // {
    //   title: "불친절한 서비스",
    //   content:
    //     "이 카페에서 받은 서비스는 정말 불친절했어요. 직원들이 무관심하고 불쾌한 표정으로 대응했습니다. 음료를 주문하고 기다리는 시간도 너무 오래 걸렸어요. 이런 태도에 실망했습니다.",
    //   rating: "HATE",
    // },
    // {
    //   title: "맛있는 커피와 친절한 서비스",
    //   content:
    //     "이 카페의 커피는 정말 맛있어요. 아로마와 풍미가 훌륭하고, 퀄리티도 높았습니다. 또한, 직원들의 서비스도 매우 친절했습니다. 항상 웃는 얼굴로 응대해주고 신속하게 음료를 제공해줬어요. 정말 만족스러운 경험이었습니다.",
    //   rating: "LIKE",
    // },
    // {
    //   title: "음료가 별로였어요",
    //   content:
    //     "이 카페에서 마신 음료는 정말 별로였습니다. 맛이 퇴색되고 부족한 향과 맛으로 인해 실망했어요. 가격에 비해 퀄리티가 너무 낮았습니다. 다른 곳을 찾아보는 것이 좋을 것 같아요.",
    //   rating: "HATE",
    // },
    // {
    //   title: "아늑한 분위기와 맛있는 음료",
    //   content:
    //     "이 카페의 분위기는 정말 아늑하고 편안합니다. 조명과 음악이 잘 어울려서 여유로운 시간을 보낼 수 있었어요. 그리고 음료도 다양하고 맛있었습니다. 가격도 합리적이라 더욱 좋았어요. 다시 방문하고 싶은 카페입니다.",
    //   rating: "LIKE",
    // },
    // {
    //   title: "서비스가 느리고 불친절해요",
    //   content:
    //     "이 카페에서의 서비스정말 느리고 불친절한 서비스를 받았어요. 주문한 음료가 나오기까지 오랜 시간이 걸렸고, 직원들은 무관심하게 대응했습니다. 손님들에 대한 배려도 없었어요. 이런 경험으로 인해 이 카페를 추천하지 않습니다. 그렇게 다른 곳을 찾아보는 것이 좋을 것 같아요.",
    //   rating: "HATE",
    // },
    // {
    //   title: "맛있는 음료, 그러나 높은 가격",
    //   content:
    //     "이 카페의 음료는 정말 맛있었어요. 풍부한 향과 훌륭한 조화로운 맛을 느낄 수 있었습니다. 하지만 가격이 다소 비싸서 아쉬웠어요. 음료의 퀄리티는 높았지만 가격 대비해서는 조금 아쉬웠던 경험이었습니다.",
    //   rating: "LIKE",
    // },
  ],
});
